{
    "document": {
        "content": [
            {
                "content": "Gathering catalog photometry and astrometry is generally straight-forward, although the process becomes notably challenging when dealing with faint or high proper motion objects. There are multiple ways to gather this information, like Aladin (), CDS Cross-Match Service (), etc. We built upon previous techniques to develop the Wide-field Retrieval of Astrodata Program (WRAP) to improve the process. Other techniques have several drawbacks, such as complex GUI interfaces, a need for understanding multiple programming languages, or a lack of visual verification. WRAP is designed to address these challenges. We start by examining previous techniques and programs in . Following that, we leverage the advantages of these prior methods to develop WRAP in .\n\n",
                "references": [
                    {
                        "label": "Bonnarel et al.(2000)",
                        "link": ""
                    },
                    {
                        "label": "Boch et al.(2012)",
                        "link": ""
                    }
                ],
                "section": "Introduction",
                "type": "text"
            },
            {
                "content": "[ht]\n        Numerous additional tools have been developed to facilitate the gathering of astrophysical data. However, discussing every software in detail here would be too enormous a task for a research note. Instead, we have highlighted some of the most popular techniques and software currently available to provide context for understanding the improvements WRAP provides.\n\nThe most prevalent approach for collecting photometric and astrometric data involves conducting cross-matches based on Right Ascension (R.A.) and Declination (Decl.). One such program is the CDS X-Match Service (; ) allowing users to search various catalogs using an input coordinate table.  However, a drawback is the absence of visual confirmation for matched data. This makes it susceptible to errors from incorrect cross-matches if the object in question has large proper motion. In contrast, other services offer visual confirmation, enhancing the accuracy of gathering astrophysical data.\n\nThe Aladin catalog search feature () shares similarities with WRAP in terms of functionality. It enables users to load images and superimpose them onto the corresponding source catalog. However, this method can be hampered by slow performance, primarily when dealing with substantial amounts of data simultaneously. Moreover, this approach is primarily designed for single object searches, limiting its applicability for more extensive cross-identification tasks.\n\nAdditional software includes the IRSA Viewer (), VizieR Photometry Viewer (), and AstroToolBox (also developed by the Backyward Worlds: Planet 9 collaboration; ). However, these tools have certain drawbacks,  briefly described here. The IRSA Viewer, for instance, lacks catalogs beyond those supported at IPAC, limiting the available data. The VizieR Photometry Viewer is comparable to the CDS X-Match Service in that it lacks readily available imaging for visual confirmation. Lastly, AstroToolBox offers both visual confirmation and cross-matching, but these features are located in separate tabs.\n\n",
                "figure_caption": "A flowchart illustrating the WRAP procedure. Here we utilize 2MASSI J1721039+334415 (\\citealt{Bardalez Gagliuffi et al.(2014)",
                "image_file": "Figure1.pdf",
                "references": [
                    {
                        "label": "Boch et al.(2012)",
                        "link": ""
                    },
                    {
                        "label": "Pineau et al.(2020)",
                        "link": ""
                    },
                    {
                        "label": "Bonnarel et al.(2000)",
                        "link": ""
                    },
                    {
                        "label": "Ochsenbein et al.(2000)",
                        "link": ""
                    },
                    {
                        "label": "Kiwy(2022)",
                        "link": ""
                    }
                ],
                "section": "Previous Techniques",
                "type": "text"
            },
            {
                "content": "To address these complications, we developed WRAP. Developed in Python 3.8 (the recommended version for using WRAP), WRAP is an open-source application designed to have minimal dependencies and low computational expenses, ensuring it remains freely accessible. After installation, the user inputs single or multi-object files (in CSV, FITS, ASCII, or IPAC table formats): R.A. (deg), Decl. (deg), search radius (arcsec), then selects the desired catalogs. The catalogs included are: CatWISE2020 Point Source Catalog (), AllWISE Source Catalog (WISE; ), Gaia Data Release 3 (Gaia; ), VISTA Science Archive catalogs (VSA; ), WFCAM Science Archive catalogs (WFCAM; ), 2MASS Point Source Catalog (2MASS; and ), PanSTARRS Data Release 2 (PanSTARRS; ), NOIRLab Source Catalog Data Release 2 (NSC; ), and the GALEX Catalog (GALEX; ). \n\nOnce inputs are selected, a WISEView () window will display WISE coadd images to aid the user in finding their object. WRAP begins by running through each catalog, showing the images with overlaid sources. Each catalog overlay comes with customizable image features, such as image stretch, photometric band selection, and circle size. Furthermore, users may add notes to any selected catalog.  After the user clicks on their chosen object, WRAP identifies the nearest object through a proximity check within the field, and the results are then saved to a .csv table (no images are saved in WRAP).\n\nIn Figure , the flowchart demonstrates the intuitive functionality of WRAP, emphasizing its user-friendly interface. The catalog overlay feature of WRAP is essential for confirmation of high motion objects, such as the illustrated object with its high proper motion of $(), that would be difficult to cross-identify through a simple positional cross-match. \n\n",
                "references": [
                    {
                        "label": "Marocco et al.(2021)",
                        "link": ""
                    },
                    {
                        "label": "Cutri et al.(2021)",
                        "link": ""
                    },
                    {
                        "label": "Gaia Collaboration et al.(2021)",
                        "link": ""
                    },
                    {
                        "label": "Irwin et al.(2004)",
                        "link": ""
                    },
                    {
                        "label": "Hambly et al.(2008)",
                        "link": ""
                    },
                    {
                        "label": "Cutri et al.(2003)",
                        "link": ""
                    },
                    {
                        "label": "Skrutskie et al.(2006)",
                        "link": ""
                    },
                    {
                        "label": "Chambers et al.(2016)",
                        "link": ""
                    },
                    {
                        "label": "Nidever et al.(2021)",
                        "link": ""
                    },
                    {
                        "label": "Martin et al.(2005)",
                        "link": ""
                    },
                    {
                        "label": "Caselden et al. 2018",
                        "link": ""
                    },
                    {
                        "label": "Bardalez Gagliuffi et al.(2014)",
                        "link": ""
                    }
                ],
                "section": "WRAP Overview",
                "type": "text"
            },
            {
                "content": "WRAP was developed to serve as a tool for astronomers seeking photometric and astrometric data for faint and high proper motion objects. It incorporates the most effective features from previous methods, resulting in a user-friendly and streamlined process. This is achieved by offering visual verification, consolidating popular catalogs in one location, and requiring no coding experience. WRAP is accessible from GitHub at the following link: . The DOI for WRAP is: . Please refer to the ReadMe file on the GitHub page for detailed installation and usage instructions. \n\n",
                "references": [],
                "section": "Conclusion",
                "type": "text"
            },
            {
                "content": "This Backyard Worlds research was supported by NASA grant 2017-ADAP17-0067. All PanSTARRS data used in this paper can be found in MAST: Bardalez Gagliuffi, D.~C., Burgasser, A.~J., Gelino, C.~R., et al.2014, , 794, 143. doi:10.1088/0004-637X/794/2/143\n\nBoch, T., Pineau, F., & Derriere, S.2012, Astronomical Data Analysis Software and Systems XXI, 461, 291\n\nBonnarel, F., Fernique, P., Bienaym'e, O., et al.2000, , 143, 33. doi:10.1051/aas:2000331\n\nGaia Collaboration, Brown, A.~G.~A., Vallenari, A., et al.2021, , 649, A1. doi:10.1051/0004-6361/202039657\n\nCaselden, D., Westin, P., Meisner, A., et al.2018, Astrophysics Source Code Library. ascl:1806.004\n\nChambers, K.~C., Magnier, E.~A., Metcalfe, N., et al.2016, arXiv:1612.05560. doi:10.48550/arXiv.1612.05560\n\nCutri, R.~M., Skrutskie, M.~F., van Dyk, S., et al.2003, ``The IRSA 2MASS All-Sky Point Source Catalog, NASA/IPAC Infrared Science Archive. \n\nCutri, R.~M., Wright, E.~L., Conrow, T., et al.2021, VizieR Online Data Catalog, II/328\n\nDye, S., Lawrence, A., Read, M.~A., et al.2018, , 473, 5113. doi:10.1093/mnras/stx2622\n\nEmerson, J.~P., Sutherland, W.~J., McPherson, A.~M., et al.2004, The Messenger, 117, 27\n\nEmerson, J.~P., Irwin, M.~J., Lewis, J., et al.2004, , 5493, 401. doi:10.1117/12.551582\n\nHambly, N.~C., Collins, R.~S., Cross, N.~J.~G., et al.2008, , 384, 637. doi:10.1111/j.1365-2966.2007.12700.x\n\nIrwin, M.~J., Lewis, J., Hodgkin, S., et al.2004, , 5493, 411. doi:10.1117/12.551449\n\nKiwy, F.2022, Astrophysics Source Code Library. ascl:2201.002\n\nLawrence, A., Warren, S.~J., Almaini, O., et al.2007, , 379, 1599. doi:10.1111/j.1365-2966.2007.12040.x\n\nMarocco, F., Eisenhardt, P.~R.~M., Fowler, J.~W., et al.2021, , 253, 8. doi:10.3847/1538-4365/abd805\n\nMartin, D.~C., Fanson, J., Schiminovich, D., et al.2005, , 619, L1. doi:10.1086/426387\n\nNidever, D.~L., Dey, A., Fasbender, K., et al.2021, , 161, 192. doi:10.3847/1538-3881/abd6e1\n\nOchsenbein, F., Bauer, P., & Marcout, J.2000, , 143, 23. doi:10.1051/aas:2000169\n\nPineau, F.-X., Boch, T., Derri`ere, S., et al.2020, Astronomical Data Analysis Software and Systems XXVII, 522, 125\n\nSkrutskie, M.~F., Cutri, R.~M., Stiening, R., et al.2006, , 131, 1163. doi:10.1086/498708\n\n",
                "references": [
                    {
                        "label": "WiseView (\\citealt{Caselden et al. 2018",
                        "link": ""
                    }
                ],
                "section": "Acknowledgements",
                "type": "text"
            }
        ],
        "metadata": {
            "authors": [
                {
                    "affiliations": [
                        "Department of Astronomy and Planetary Science, Northern Arizona University, Flagstaff, AZ 86011, USA"
                    ],
                    "name": "Hunter Brooks"
                },
                {
                    "affiliations": [
                        "IPAC, Mail Code 100-22, Caltech, 1200 E. California Blvd., Pasadena, CA 91125, USA"
                    ],
                    "name": "J.\\ Davy Kirkpatrick"
                },
                {
                    "affiliations": [
                        "Department of Astrophysics, American Museum of Natural History, Central Park West at 79th Street, New York, NY 10024, USA"
                    ],
                    "name": "Dan Caselden"
                },
                {
                    "affiliations": [
                        "United States Naval Observatory, Flagstaff Station, 10391 West Naval Observatory Rd., Flagstaff, AZ 86005, USA"
                    ],
                    "name": "Adam C. Schneider"
                },
                {
                    "affiliations": [
                        "NSF's National Optical-Infrared Astronomy Research\nLaboratory, 950 N. Cherry Ave., Tucson, AZ 85719, USA"
                    ],
                    "name": "Aaron M. Meisner"
                },
                {
                    "affiliations": [
                        "Backyard Worlds: Planet 9"
                    ],
                    "name": "Yadukrishna Raghu"
                },
                {
                    "affiliations": [
                        "Backyard Worlds: Planet 9"
                    ],
                    "name": "Farid Cedeno"
                },
                {
                    "affiliations": [
                        "Department of Astrophysics, American Museum of Natural History, Central Park West at 79th Street, New York, NY 10024, USA"
                    ],
                    "name": "Jacqueline K. Faherty"
                },
                {
                    "affiliations": [
                        "IPAC, Mail Code 100-22, Caltech, 1200 E. California Blvd., Pasadena, CA 91125, USA"
                    ],
                    "name": "Federico Marocco"
                },
                {
                    "affiliations": [
                        "NASA Goddard Space Flight Center, Exoplanets and Stellar Astrophysics Laboratory, Code 667, Greenbelt, MD 20771, USA"
                    ],
                    "name": "Marc J. Kuchner"
                },
                {
                    "affiliations": [
                        "School of Physics and Astronomy, University of Leicester, University Road, Leicester, LE1 7RH, UK"
                    ],
                    "name": "S.L.Casewell"
                }
            ]
        },
        "title": "WRAP: A Tool for Efficient Cross-Identification of Proper Motion Objects Spanning Multiple Surveys "
    }
}